#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth.module.client_grad-793.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=28432589-7518-4455-8548-a24d85ce6bee]
module.keycloak_dev.module.onestopauth.module.client_grad-793.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4f77a24d-8e4d-4ec0-aef0-7d042b72dac3]
module.keycloak_dev.module.onestopauth.module.client_grad-793.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=98856f34-dcd6-4451-a2fc-4827d7fdf0f3]
module.keycloak_dev.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=61ba36cc-85c4-4a29-9ec6-24d8f084a2ef]
module.keycloak_dev.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a3652228-cde4-4b18-94c8-7ad95dd2c75e]
module.keycloak_dev.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c4158cca-c5a0-4a5c-9339-1fa87acfdd5c]
module.keycloak_dev.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=03d53390-0147-47ad-875a-a9f0927b9bfc]
module.keycloak_dev.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=328730fd-9df2-406d-b43d-0e5b450c6ed0]
module.keycloak_dev.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3da90b88-8373-4935-821f-105dd858915c]
module.keycloak_dev.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=7ae4b92b-7821-4914-8e71-ff2ce15bec26]
module.keycloak_dev.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c89902ef-e229-43c1-89d2-06cfb1c710d8]
module.keycloak_dev.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f35d6034-50c7-439d-9bf3-697805ad6c8f]
module.keycloak_dev.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=8856ad9b-6674-4415-8720-fefb81dd9c2e]
module.keycloak_dev.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=bb2304f6-f7cf-4265-a421-8413dbd6f542]
module.keycloak_dev.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=f30db6b7-1251-4646-98cd-5c083e48b338]
module.keycloak_dev.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=9ba9c286-6723-4e59-95b0-07005b6378f1]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ac4101b1-a5f1-4552-90df-639831c6d7d8]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ee5f65ba-c02b-438b-9779-b790910e0db0]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=fe253f42-fa4c-4de5-931c-5d2eb5a06072]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c5e74057-c94f-4a30-b18c-84fb1d500477]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ce54c332-46a6-4f14-9e3f-be5e5b933ff1]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=94ff68ca-1fd6-446d-847b-7d6ad9392901]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d59efa72-b2de-4586-895e-aefce069184c]
module.keycloak_dev.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c73d68b1-237c-44c0-8e11-eb66b563f691]
module.keycloak_dev.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=99c97779-aa78-4420-8248-20a461528849]
module.keycloak_dev.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ec52c1e4-14de-465a-9858-2a9e0afbeccb]
module.keycloak_dev.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=875deb5a-052e-4f66-a602-02409b04fcb7]
module.keycloak_dev.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=41379ebf-90a9-439f-892c-4a4119c80a00]
module.keycloak_dev.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=91f3c146-8781-48ca-9c7d-be2ffacec351]
module.keycloak_dev.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=16abce0e-4ddb-4dae-9c20-b60a6d94911e]
module.keycloak_dev.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=a8192ab6-2021-4e46-a584-da32696bf986]
module.keycloak_dev.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=df829a6b-52fd-4409-a61e-cbedf081a052]
module.keycloak_dev.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=b9b73ec6-6f28-41bb-8e11-6aef62bf9322]
module.keycloak_dev.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d8fca9c8-9be0-4467-ae02-d8722543d508]
module.keycloak_dev.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=6f98e5c9-fbd2-40f8-91c5-3ba2a4c12802]
module.keycloak_dev.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=07617684-e189-4448-b8a5-b4beba0b9b06]
module.keycloak_dev.module.onestopauth.module.client_realm-profile-app-760.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=f8b93595-bfc3-40fa-ae0f-d68bc74d1b46]
module.keycloak_dev.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=da23c480-d871-4c59-8a47-b4293a54337e]
module.keycloak_dev.module.onestopauth.module.client_realm-profile-app-760.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=648d1a98-a7c4-4a8d-88df-0ea74209cbc7]
module.keycloak_dev.module.onestopauth.module.client_realm-profile-app-760.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8c0c829a-fe5c-4e11-a22d-4d6f9d128199]
module.keycloak_dev.module.onestopauth.module.client_realm-profile-app-760.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a500d64a-f587-4b31-abb5-382c6eda4dd1]
module.keycloak_dev.module.onestopauth.module.client_realm-profile-app-760.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=1ffc138f-491e-4936-9196-e76a082e2bcc]
module.keycloak_dev.module.onestopauth.module.client_realm-profile-app-760.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=0e19c405-54a0-4a04-a957-c6586682a6dc]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2cc06bf6-6ce0-403a-a596-f2d85cd3e64d]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=11463c0e-ffcb-4620-90d5-d3bc3453b6b3]
module.keycloak_dev.module.onestopauth.module.client_realm-profile-app-760.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=04043838-9c59-44d4-9bcd-5e345048a8a1]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=edc0aa1e-ba42-4b33-9aa0-bcc3c853b22d]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=98e2c03c-c4b2-4247-afcb-2f7c4587a19e]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4c7f560b-d0b7-4451-a70c-b0cff899b3dd]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=da101df4-6f77-4730-9aae-e031254c68c6]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=972b7c2f-0c1f-4623-92de-da5f4720dd1f]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources-496.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=fec7db43-9151-4e0b-b69a-e8eb19ac92dc]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources-496.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=3be52c8d-ca06-488b-b6ef-10f84d06851d]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources-496.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=e003a8fb-7946-4d0b-b870-995c5676fb36]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources-496.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c2b1b497-2169-4a24-a078-ecd9d71eca8f]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources-496.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ea1f2f64-0474-41a4-b95b-5278cf030d3d]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources-496.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=218b70cf-21fe-4146-9a01-184f51d13be1]
module.keycloak_dev.module.onestopauth.module.client_clean-transportation-data-hub-595.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=bb6c20b5-ccb0-45c7-80be-3ca70ac03200]
module.keycloak_dev.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=75d6c120-1cb3-47a0-9cfb-887007f56e43]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources-496.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f7080f87-42a3-4991-8b8e-d993db6c8341]
module.keycloak_dev.module.onestopauth.module.client_clean-transportation-data-hub-595.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=02b3f252-c5be-47ff-928a-f0c3566cc8c4]
module.keycloak_dev.module.onestopauth.module.client_clean-transportation-data-hub-595.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ef5e15cc-7be8-48d7-afe8-da5f9277d9b6]
module.keycloak_dev.module.onestopauth.module.client_clean-transportation-data-hub-595.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6a53aca9-9cff-4bc9-811c-e925ff11a26f]
module.keycloak_dev.module.onestopauth.module.client_clean-transportation-data-hub-595.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=7c628830-fba5-42fa-a14a-cda300f43689]
module.keycloak_dev.module.onestopauth.module.client_clean-transportation-data-hub-595.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d2035cef-9cca-485d-a3a8-3f59111dcddf]
module.keycloak_dev.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=6e8d5758-5957-42ee-a09c-85b705220239]
module.keycloak_dev.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=36b7d08e-26aa-43f4-80db-0d4f974ddc84]
module.keycloak_dev.module.onestopauth.module.client_clean-transportation-data-hub-595.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=befabf90-ccf2-4d29-bf31-3ce04a0ac860]
module.keycloak_dev.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4a64e6b4-6031-423a-b60a-5d4adc255a9c]
module.keycloak_dev.module.onestopauth.module.client_sso-requests.keycloak_role.client_role["bceid-approver"]: Refreshing state... [id=1ef48d7b-bb3f-4a04-9d84-46a494eef84e]
module.keycloak_dev.module.onestopauth.module.client_sso-requests.keycloak_role.client_role["sso-admin"]: Refreshing state... [id=c744ac3d-02e2-4224-a320-fe60610babf5]
module.keycloak_dev.module.onestopauth.module.client_grad-826.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=cfbc1d24-acb9-4310-8089-a7d6cb308bef]
module.keycloak_dev.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=2a2d6d1b-e906-409b-a1c9-f92865467a7b]
module.keycloak_dev.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a72e685b-b22a-4e3e-b912-d517a1397a3e]
module.keycloak_dev.module.onestopauth.module.client_grad-826.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f4869200-a221-415a-8f23-7e7e47ae87a0]
module.keycloak_dev.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=732f303b-2e16-47ea-9a83-eda07c11c1ad]
module.keycloak_dev.module.onestopauth.module.client_grad-826.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=0d951753-f787-4260-9d3d-d2f56d448200]
module.keycloak_dev.module.onestopauth.module.client_grad-826.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a447d9a6-6eea-40e9-9677-7d308d8366ef]
module.keycloak_dev.module.onestopauth.module.client_dss-kirk-1288.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ec2c1af0-49f2-48cf-b225-5a6d862af795]
module.keycloak_dev.module.onestopauth.module.client_grad-826.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=1fc6ae2d-a541-4abf-979b-ac2ef7ce2051]
module.keycloak_dev.module.onestopauth.module.client_grad-826.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=94f4cfe1-1d21-4c16-a4a2-904be9452d14]
module.keycloak_dev.module.onestopauth.module.client_grad-826.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ba8a4c57-1894-4f51-b346-f326010faa1e]
module.keycloak_dev.module.onestopauth.module.client_dss-kirk-1288.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=4110c5fd-eec8-4c21-98a6-6ab6cd11f47b]
module.keycloak_dev.module.onestopauth.module.client_dss-kirk-1288.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0cf0f92b-3490-4b55-b2e6-9d2654201f28]
module.keycloak_dev.module.onestopauth.module.client_dss-kirk-1288.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=66685371-97dc-410c-8d77-8e5ec936421c]
module.keycloak_dev.module.onestopauth.module.client_dss-kirk-1288.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=06809705-55fc-470f-9b09-2053ff6875bf]
module.keycloak_dev.module.onestopauth.module.client_dss-kirk-1288.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=fe3c6fba-9ab4-439f-ae16-8e8a83d0020a]
module.keycloak_dev.module.onestopauth.module.client_dss-kirk-1288.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f8cd2400-8479-4bb7-bb3f-ec160302c9f4]
module.keycloak_dev.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e20f31c0-6a4b-44fd-98c2-d9210456df34]
module.keycloak_dev.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=f21dcf54-0ed0-4a92-9145-626a1a91c109]
module.keycloak_dev.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f3b79bdc-00a8-4ebb-97bc-6c84d11aa9f6]
module.keycloak_dev.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=00c7a487-7075-4579-b851-4e631a988ce9]
module.keycloak_dev.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a5434c9d-400c-4d17-8712-8a992d506e46]
module.keycloak_dev.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=12ce064d-e521-4626-a4e8-6f95fe6cdd80]
module.keycloak_dev.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a2bea357-902a-4419-9436-371f028420cf]
module.keycloak_dev.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3c4fbad9-e32a-46eb-84fd-0361ab7a6094]
module.keycloak_dev.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d088d08a-929a-461e-9fee-17e94ddb43d4]
module.keycloak_dev.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=82b2f737-051a-4e88-9370-dda9639dcc83]
module.keycloak_dev.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0b9dbc75-8497-4a3a-ae80-5ec1d070c04d]
module.keycloak_dev.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=85ff24a6-076c-4a24-b035-e658e99705ab]
module.keycloak_dev.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6f01200d-ad1d-44c9-aa64-696e4ad03a6e]
module.keycloak_dev.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=a10224f4-628d-4243-bfef-8dc15a6273dd]
module.keycloak_dev.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=9d4e0664-8be7-48f4-a5c1-76e3a3f8227e]
module.keycloak_dev.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=bdf21b43-a3b7-4194-900e-6236996b3567]
module.keycloak_dev.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=2cac2751-fab8-43b2-a039-3df4688c7855]
module.keycloak_dev.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ff29fbf0-c2a0-4f4d-ae30-000529dcb8b4]
module.keycloak_dev.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5e0049b4-18b9-470d-9b9b-4b061a0c0224]
module.keycloak_dev.module.onestopauth_basic.module.client_tti-poc-public-1189.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=aa124fd1-7e66-4f30-8c3a-0df372fc2d61]
module.keycloak_dev.module.onestopauth_basic.module.client_tti-poc-public-1189.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5deeed98-2513-4469-b8a6-103c0414615b]
module.keycloak_dev.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=889742ce-e722-4e9b-82fb-5ae522d3b0b8]
module.keycloak_dev.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=4d1e1a56-10fa-4e08-8390-107290ee1cb8]
module.keycloak_dev.module.onestopauth_basic.module.client_tti-poc-public-1189.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=7ee0bd1b-0cc2-4266-8a40-ea7bf0974345]
module.keycloak_dev.module.onestopauth_basic.module.client_tti-poc-public-1189.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=da399ab0-d949-4994-b15c-65bc3c3b9528]
module.keycloak_dev.module.onestopauth_basic.module.client_tti-poc-public-1189.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=344b6955-36cf-4be9-b223-c56cbc745d64]
module.keycloak_dev.module.onestopauth_basic.module.client_tti-poc-public-1189.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=99f007a2-b501-4d32-8a66-710e67c8a6dd]
module.keycloak_dev.module.onestopauth_basic.module.client_tti-poc-public-1189.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=a5302ea5-9ee7-43ab-a687-cee8cbd82600]
module.keycloak_dev.module.onestopauth_basic.module.client_jsb-csrs-991.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e80903bb-cad8-455a-8b8e-77f27bf3bf0e]
module.keycloak_dev.module.onestopauth_basic.module.client_jsb-csrs-991.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=31a9cd0a-bd3b-4672-9ff3-717c28788e1d]
module.keycloak_dev.module.onestopauth_basic.module.client_jsb-csrs-991.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6fa296f9-d73c-445b-b59a-66da299b8fe0]
module.keycloak_dev.module.onestopauth_basic.module.client_jsb-csrs-991.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=f6119fc1-5a1e-4174-8219-71bfbba78895]
module.keycloak_dev.module.onestopauth_basic.module.client_jsb-csrs-991.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=c2b62032-3d76-40ea-846b-c2524c2effac]
module.keycloak_dev.module.onestopauth_basic.module.client_tti-poc-1025.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=323cbe2d-efd6-451e-b8a9-ac11d2b3dcac]
module.keycloak_dev.module.onestopauth_basic.module.client_tti-poc-1025.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=dd369c3f-2521-4183-8c64-734f397dab4d]
module.keycloak_dev.module.onestopauth_basic.module.client_jsb-csrs-991.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=cb642841-1bfa-46d0-9375-ce7f90efc1fb]
module.keycloak_dev.module.onestopauth_basic.module.client_tti-poc-1025.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=fe8f0148-4949-41c1-853e-1998c5690875]
module.keycloak_dev.module.onestopauth_basic.module.client_tti-poc-1025.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a2da131f-b0a1-4077-a99f-fc5a74807f4b]
module.keycloak_dev.module.onestopauth_basic.module.client_tti-poc-1025.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=cf10a3f9-d78b-425a-8c4e-784e5112e2f6]
module.keycloak_dev.module.onestopauth_basic.module.client_jsb-csrs-991.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=52f9cc73-af34-41da-9868-04cff454e3bc]
module.keycloak_dev.module.onestopauth_basic.module.client_tti-poc-1025.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cc2c1d3f-82d9-477c-b4d9-f358a1cfc362]
module.keycloak_dev.module.onestopauth_basic.module.client_tti-poc-1025.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=0b86f6e5-099b-4409-847f-c13eb66ec4dd]
module.keycloak_dev.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=8676ae1e-33e9-4f86-acf9-02c8636928c8]
module.keycloak_dev.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=465edd6a-aaa8-4c49-a042-53a56798f582]
module.keycloak_dev.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=29935c7c-1439-4665-9d86-02672a8d71ad]
module.keycloak_dev.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=324970c7-bdb6-4f3e-8f8d-797e7d010ac7]
module.keycloak_dev.module.onestopauth_basic.module.client_testclient-request1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d8f3385d-373d-4eee-917b-7967f725ec79]
module.keycloak_dev.module.onestopauth_basic.module.client_testclient-request1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d5f0ac9d-5d82-4162-9291-7b504da9f90b]
module.keycloak_dev.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=027a0e5a-ec26-4d4b-a7c1-38c74d3927f4]
module.keycloak_dev.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=9233062d-7b5d-4bc8-847d-99dcd6d7dac6]
module.keycloak_dev.module.onestopauth_basic.module.client_testclient-request1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=0c4cf74f-bd9d-4132-9aad-61386c6a6276]
module.keycloak_dev.module.onestopauth_basic.module.client_testclient-request1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=6317c2ef-91bd-46a1-963a-0a7afdeaf7c9]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8eaf3833-1600-4c88-add9-733a8db25320]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=73347af8-9d7f-41c6-b41b-57a19bcdd922]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=9c47eb8e-e8cc-4fe5-ad64-cf9a9f4eb7ad]
module.keycloak_dev.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b54e506f-f9ec-4168-8c28-5f0b19c4ecd0]
module.keycloak_dev.module.onestopauth_basic.module.client_testclient-request1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2dc6e22c-402c-4789-a572-9a26cc2a693a]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c74e0d2a-bd3e-46ec-9b04-0249629c5110]
module.keycloak_dev.module.onestopauth_basic.module.client_testclient-request1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=cc148327-319c-475c-a943-8a313bc7f828]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=78a3fbe3-f8de-4d37-a66c-792e6ee66f87]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6fc927d9-9245-4aa1-98ef-441e07cb05ef]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f4036e5b-1106-4ac4-9830-cba8c1b748a7]
module.keycloak_dev.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f277c433-dfd2-4e20-a66e-ccfda7059b4c]
module.keycloak_dev.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=db6a1331-bb77-4352-a4db-e70aacbd2dee]
module.keycloak_dev.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=99202aa7-1878-4183-aa07-d83bed9002ed]
module.keycloak_dev.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e08eb222-d232-44d1-8a3b-02162764b0b7]
module.keycloak_dev.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=dbb8d93f-8bf6-47ba-9280-f2902412d568]
module.keycloak_dev.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=5a2c1ec6-1b74-4ff9-9dc8-146091e16d41]
module.keycloak_dev.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=4c929283-3ab7-4e43-a7e5-65de6046bf18]
module.keycloak_dev.module.onestopauth_basic.module.client_testclient-request1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2fa4c6a4-df79-4d65-990b-6ad664f88e84]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-1387.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "bceid-test-1387"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-1387.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-1387.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-1387.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-1387.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "bceid-test-1387"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-1387.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-1387.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-1387.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "bceid-test-1387"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "bceid-test-1387"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://a",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-1387.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "bceid-test-1387"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-1387.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-1387.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-1387.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-1387.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "bceid-test-1387"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-1387.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-1387.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-1387.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "bceid-test-1387"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "bceid-test-1387"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://a",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

Plan: 16 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 494 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*